/* In browser window title */
"Get a registration key!" = "Nem regisztrált";

/* The full name of the supporter */
"Registered to {0}" = "Regisztrálta {0}";

/* Cyberduck is open source software */
"Thanks for your support! Your contribution helps to further advance development to make Cyberduck even better." = "Az Ön hozzájárulása segít a fejlesztés előmozdításában, hogy a Cyberduck még jobb legyen.";

/* Copy of donation key */
"Your registration key has been copied to the Application Support folder." = "A regisztrációs kulcsát az alkalmazás-támogatási mappába másoltuk.";

/* Validation failed */
"Not a valid registration key" = "Érvénytelen regisztrációs kulcs";

"This registration key does not appear to be valid." = "Ez a regisztrációs kulcs nem tűnik érvényesnek.";

/* Thank you */
"Continue" = "Folytatás";
